tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1777_tdd.h
#define DAC6REF14                     2207
#define DAC6REFH_R14                  2208
#define DAC6REFH_REF14                2209
#define DAC6R15                       2210
#define DAC6REF15                     2211
#define DAC6REFH_R15                  2212
#define DAC6REFH_REF15                2213
#define DAC7CON0                      2214
#define DAC7CON0_NSS0                 2215
#define DAC7NSS                       2216
#define DAC7CON0_DACNSS0              2217
#define DAC7NSS0                      2218
#define DAC7CON0_DACNSS               2219
#define DAC7CON0_NSS                  2220
#define DAC7CON0_NSS1                 2221
#define DAC7CON0_DACNSS1              2222
#define DAC7NSS1                      2223
#define DAC7CON0_DACPSS0              2224
#define DAC7CON0_PSS0                 2225
#define DAC7CON0_DACPSS               2226
#define DAC7PSS0                      2227
#define DAC7PSS                       2228
#define DAC7CON0_PSS                  2229
#define DAC7CON0_DACPSS1              2230
#define DAC7CON0_PSS1                 2231
#define DAC7PSS1                      2232
#define DAC7CON0_DACOE2               2233
#define DAC7CON0_OE2                  2234
#define DAC7OE2                       2235
#define DAC7CON0_OE1                  2236
#define DAC7OE1                       2237
#define DAC7CON0_DACOE1               2238
#define DAC7CON0_EN                   2239
#define DAC7EN                        2240
#define DAC7CON0_DACEN                2241
#define DAC7REF                       2242
#define DAC7R                         2243
#define DAC7REF_R0                    2244
#define DAC7REF_REF0                  2245
#define DAC7REF0                      2246
#define DAC7REF_DACR0                 2247
#define DAC7REF_DACR                  2248
#define DAC7R0                        2249
#define DAC7REF_R1                    2250
#define DAC7REF_REF1                  2251
#define DAC7REF1                      2252
#define DAC7REF_DACR1                 2253
#define DAC7R1                        2254
#define DAC7REF_R2                    2255
#define DAC7REF2                      2256
#define DAC7REF_DACR2                 2257
#define DAC7REF_REF2                  2258
#define DAC7R2                        2259
#define DAC7REF_R3                    2260
#define DAC7REF_REF3                  2261
#define DAC7REF3                      2262
#define DAC7REF_DACR3                 2263
#define DAC7R3                        2264
#define DAC7REF_R4                    2265
#define DAC7REF4                      2266
#define DAC7REF_REF4                  2267
#define DAC7REF_DACR4                 2268
#define DAC7R4                        2269
#define DAC8CON0                      2270
#define DAC8CON0_NSS0                 2271
#define DAC8NSS                       2272
#define DAC8CON0_DACNSS0              2273
#define DAC8NSS0                      2274
#define DAC8CON0_DACNSS               2275
#define DAC8CON0_NSS                  2276
#define DAC8CON0_NSS1                 2277
#define DAC8CON0_DACNSS1              2278
#define DAC8NSS1                      2279
#define DAC8PSS                       2280
#define DAC8CON0_DACPSS               2281
#define DAC8CON0_DACPSS0              2282
#define DAC8CON0_PSS                  2283
#define DAC8CON0_PSS0                 2284
#define DAC8PSS0                      2285
#define DAC8CON0_DACPSS1              2286
#define DAC8CON0_PSS1                 2287
#define DAC8PSS1                      2288
#define DAC8CON0_OE2                  2289
#define DAC8CON0_DACOE2               2290
#define DAC8OE2                       2291
#define DAC8CON0_OE1                  2292
#define DAC8CON0_DACOE1               2293
#define DAC8OE1                       2294
#define DAC8EN                        2295
#define DAC8CON0_EN                   2296
#define DAC8CON0_DACEN                2297
#define DAC8REF                       2298
#define DAC8REF_DACR0                 2299
#define DAC8R                         2300
#define DAC8REF0                      2301
#define DAC8R0                        2302
#define DAC8REF_REF0                  2303
#define DAC8REF_R0                    2304
#define DAC8REF_DACR                  2305
#define DAC8REF_DACR1                 2306
#define DAC8R1                        2307
#define DAC8REF1                      2308
#define DAC8REF_REF1                  2309
#define DAC8REF_R1                    2310
#define DAC8REF_DACR2                 2311
#define DAC8REF2                      2312
#define DAC8R2                        2313
#define DAC8REF_REF2                  2314
#define DAC8REF_R2                    2315
#define DAC8REF_DACR3                 2316
#define DAC8R3                        2317
#define DAC8REF_REF3                  2318
#define DAC8REF3                      2319
#define DAC8REF_R3                    2320
#define DAC8REF_DACR4                 2321
#define DAC8R4                        2322
#define DAC8REF_REF4                  2323
#define DAC8REF_R4                    2324
#define DAC8REF4                      2325
#define PRG4RTSS                      2326
#define PRG4RTSS_RTSS0                2327
#define RG4RTSS0                      2328
#define PRG4RTSS_RTSS                 2329
#define RG4RTSS1                      2330
#define PRG4RTSS_RTSS1                2331
#define PRG4RTSS_RTSS2                2332
#define RG4RTSS2                      2333
#define PRG4RTSS_RTSS3                2334
#define RG4RTSS3                      2335
#define PRG4FTSS                      2336
#define PRG4FTSS_FTSS0                2337
#define PRG4FTSS_FTSS                 2338
#define RG4FTSS0                      2339
#define RG4FTSS1                      2340
#define PRG4FTSS_FTSS1                2341
#define PRG4FTSS_FTSS2                2342
#define RG4FTSS2                      2343
#define PRG4FTSS_FTSS3                2344
#define RG4FTSS3                      2345
#define PRG4INS                       2346
#define RG4INS0                       2347
#define PRG4INS_INS0                  2348
#define PRG4INS_INS                   2349
#define RG4INS1                       2350
#define PRG4INS_INS1                  2351
#define RG4INS2                       2352
#define PRG4INS_INS2                  2353
#define RG4INS3                       2354
#define PRG4INS_INS3                  2355
#define PRG4CON0                      2356
#define PRG4CON0_GO                   2357
#define RG4GO                         2358
#define PRG4CON0_OS                   2359
#define RG4OS                         2360
#define RG4MODE                       2361
#define PRG4CON0_MODE                 2362
#define PRG4CON0_MODE0                2363
#define RG4MODE0                      2364
#define PRG4CON0_MODE1                2365
#define RG4MODE1                      2366
#define PRG4CON0_REDG                 2367
#define RG4REDG                       2368
#define RG4FEDG                       2369
#define PRG4CON0_FEDG                 2370
#define PRG4CON0_EN                   2371
#define RG4EN                         2372
#define PRG4CON1                      2373
#define PRG4CON1_RPOL                 2374
#define RG4RPOL                       2375
#define PRG4CON1_FPOL                 2376
#define RG4FPOL                       2377
#define PRG4CON1_RDY                  2378
#define RG4RDY                        2379
#define PRG4CON2                      2380
#define RG4ISET                       2381
#define PRG4CON2_ISET0                2382
#define RG4ISET0                      2383
#define PRG4CON2_ISET                 2384
#define RG4ISET1                      2385
#define PRG4CON2_ISET1                2386
#define PRG4CON2_ISET2                2387
#define RG4ISET2                      2388
#define RG4ISET3                      2389
#define PRG4CON2_ISET3                2390
#define RG4ISET4                      2391
#define PRG4CON2_ISET4                2392
#define PWM3DCL                       2393
#define PWM3DC0                       2394
#define PWM3DCL_PWMPW0                2395
#define PWM3DCL_DC0                   2396
#define PWM3DCL_DC                    2397
#define PWM3DC1                       2398
#define PWM3DCL_PWMPW1                2399
#define PWM3DCL_DC1                   2400
#define PWM3DCH                       2401
#define PWM3DC2                       2402
#define PWM3DCH_DC2                   2403
#define PWM3DCH_DC                    2404
#define PWM3DCH_PWMPW2                2405
#define PWM3DC3                       2406
#define PWM3DCH_DC3                   2407
#define PWM3DCH_PWMPW3                2408
#define PWM3DC4                       2409
#define PWM3DCH_DC4                   2410
#define PWM3DCH_PWMPW4                2411
#define PWM3DC5                       2412
#define PWM3DCH_DC5                   2413
#define PWM3DCH_PWMPW5                2414
#define PWM3DC6                       2415
#define PWM3DCH_DC6                   2416
#define PWM3DCH_PWMPW6                2417
#define PWM3DC7                       2418
#define PWM3DCH_DC7                   2419
#define PWM3DCH_PWMPW7                2420
#define PWM3DC8                       2421
#define PWM3DCH_DC8                   2422
#define PWM3DCH_PWMPW8                2423
#define PWM3DC9                       2424
#define PWM3DCH_DC9                   2425
#define PWM3DCH_PWMPW9                2426
#define PWM3CON                       2427
#define PWM3CON_POL                   2428
#define PWM3POL                       2429
#define PWM3CON_OUT                   2430
#define PWM3OUT                       2431
#define PWM3EN                        2432
#define PWM3CON_EN                    2433
#define PWM4DCL                       2434
#define PWM4DCL_PWMPW0                2435
#define PWM4DCL_DC                    2436
#define PWM4DC0                       2437
#define PWM4DCL_DC0                   2438
#define PWM4DCL_PWMPW1                2439
#define PWM4DC1                       2440
#define PWM4DCL_DC1                   2441
#define PWM4DCH                       2442
#define PWM4DCH_PWMPW2                2443
#define PWM4DCH_DC                    2444
#define PWM4DC2                       2445
#define PWM4DCH_DC2                   2446
#define PWM4DCH_PWMPW3                2447
#define PWM4DC3                       2448
#define PWM4DCH_DC3                   2449
#define PWM4DCH_PWMPW4                2450
#define PWM4DC4                       2451
#define PWM4DCH_DC4                   2452
#define PWM4DCH_PWMPW5                2453
#define PWM4DC5                       2454
#define PWM4DCH_DC5                   2455
#define PWM4DCH_PWMPW6                2456
#define PWM4DC6                       2457
#define PWM4DCH_DC6                   2458
#define PWM4DCH_PWMPW7                2459
#define PWM4DC7                       2460
#define PWM4DCH_DC7                   2461
#define PWM4DCH_PWMPW8                2462
#define PWM4DC8                       2463
#define PWM4DCH_DC8                   2464
#define PWM4DCH_PWMPW9                2465
#define PWM4DC9                       2466
#define PWM4DCH_DC9                   2467
#define PWM4CON                       2468
#define PWM4POL                       2469
#define PWM4CON_POL                   2470
#define PWM4CON_OUT                   2471
#define PWM4OUT                       2472
#define PWM4EN                        2473
#define PWM4CON_EN                    2474
#define PWM9DCL                       2475
#define PWM9DC0                       2476
#define PWM9DCL_DC                    2477
#define PWM9DCL_PWMPW0                2478
#define PWM9DCL_DC0                   2479
#define PWM9DC1                       2480
#define PWM9DCL_PWMPW1                2481
#define PWM9DCL_DC1                   2482
#define PWM9DCH                       2483
#define PWM9DCH_PWMPW2                2484
#define PWM9DC2                       2485
#define PWM9DCH_DC                    2486
#define PWM9DCH_DC2                   2487
#define PWM9DCH_PWMPW3                2488
#define PWM9DC3                       2489
#define PWM9DCH_DC3                   2490
#define PWM9DC4                       2491
#define PWM9DCH_PWMPW4                2492
#define PWM9DCH_DC4                   2493
#define PWM9DC5                       2494
#define PWM9DCH_PWMPW5                2495
#define PWM9DCH_DC5                   2496
#define PWM9DC6                       2497
#define PWM9DCH_PWMPW6                2498
#define PWM9DCH_DC6                   2499
#define PWM9DC7                       2500
#define PWM9DCH_PWMPW7                2501
#define PWM9DCH_DC7                   2502
#define PWM9DC8                       2503
#define PWM9DCH_PWMPW8                2504
#define PWM9DCH_DC8                   2505
#define PWM9DC9                       2506
#define PWM9DCH_DC9                   2507
#define PWM9DCH_PWMPW9                2508
#define PWM9CON                       2509
#define PWM9POL                       2510
#define PWM9CON_POL                   2511
#define PWM9OUT                       2512
#define PWM9CON_OUT                   2513
#define PWM9CON_EN                    2514
#define PWM9EN                        2515
#define PWM10DCL                      2516
#define PWM10DCL_DC                   2517
#define PWM10DC0                      2518
#define PWM10DCL_PWMPW0               2519
#define PWM10DCL_DC0                  2520
#define PWM10DC1                      2521
#define PWM10DCL_PWMPW1               2522
#define PWM10DCL_DC1                  2523
#define PWM10DCH                      2524
#define PWM10DCH_DC                   2525
#define PWM10DC2                      2526
#define PWM10DCH_PWMPW2               2527
#define PWM10DCH_DC2                  2528
#define PWM10DC3                      2529
#define PWM10DCH_PWMPW3               2530
#define PWM10DCH_DC3                  2531
#define PWM10DC4                      2532
#define PWM10DCH_PWMPW4               2533
#define PWM10DCH_DC4                  2534
#define PWM10DC5                      2535
#define PWM10DCH_PWMPW5               2536
#define PWM10DCH_DC5                  2537
#define PWM10DC6                      2538
#define PWM10DCH_PWMPW6               2539
#define PWM10DCH_DC6                  2540
#define PWM10DC7                      2541
#define PWM10DCH_PWMPW7               2542
#define PWM10DCH_DC7                  2543
#define PWM10DCH_DC8                  2544
#define PWM10DC8                      2545
#define PWM10DCH_PWMPW8               2546
#define PWM10DC9                      2547
#define PWM10DCH_PWMPW9               2548
#define PWM10DCH_DC9                  2549
#define PWM10CON                      2550
#define PWM10POL                      2551
#define PWM10CON_POL                  2552
#define PWM10CON_OUT                  2553
#define PWM10OUT                      2554
#define PWM10EN                       2555
#define PWM10CON_EN                   2556
#define COG1PHR                       2557
#define G1PHR0                        2558
#define COG1PHR_PHR                   2559
#define COG1PHR_PHR0                  2560
#define G1PHR1                        2561
#define COG1PHR_PHR1                  2562
#define COG1PHR_PHR2                  2563
#define G1PHR2                        2564
#define COG1PHR_PHR3                  2565
#define G1PHR3                        2566
#define G1PHR4                        2567
#define COG1PHR_PHR4                  2568
#define G1PHR5                        2569
#define COG1PHR_PHR5                  2570
#define COG1PHF                       2571
#define G1PHF0                        2572
#define COG1PHF_PHF0                  2573
#define COG1PHF_PHF                   2574
#define G1PHF1                        2575
#define COG1PHF_PHF1                  2576
#define G1PHF2                        2577
#define COG1PHF_PHF2                  2578
#define G1PHF3                        2579
#define COG1PHF_PHF3                  2580
#define G1PHF4                        2581
#define COG1PHF_PHF4                  2582
#define G1PHF5                        2583
#define COG1PHF_PHF5                  2584
#define COG1BLKR                      2585
#define COG1BLKR_BLKR                 2586
#define COG1BLKR_BLKR0                2587
#define G1BLKR0                       2588
#define COG1BLKR_BLKR1                2589
#define G1BLKR1                       2590
#define COG1BLKR_BLKR2                2591
#define G1BLKR2                       2592
#define COG1BLKR_BLKR3                2593
#define G1BLKR3                       2594
#define COG1BLKR_BLKR4                2595
#define G1BLKR4                       2596
#define G1BLKR5                       2597
#define COG1BLKR_BLKR5                2598
#define COG1BLKF                      2599
#define COG1BLKF_BLKF                 2600
#define G1BLKF0                       2601
#define COG1BLKF_BLKF0                2602
#define G1BLKF1                       2603
#define COG1BLKF_BLKF1                2604
#define COG1BLKF_BLKF2                2605
#define G1BLKF2                       2606
#define G1BLKF3                       2607
#define COG1BLKF_BLKF3                2608
#define COG1BLKF_BLKF4                2609
#define G1BLKF4                       2610
#define G1BLKF5                       2611
#define COG1BLKF_BLKF5                2612
#define COG1DBR                       2613
#define G1DBR0                        2614
#define COG1DBR_DBR                   2615
#define COG1DBR_DBR0                  2616
#define G1DBR1                        2617
#define COG1DBR_DBR1                  2618
#define G1DBR2                        2619
#define COG1DBR_DBR2                  2620
#define G1DBR3                        2621
#define COG1DBR_DBR3                  2622
#define G1DBR4                        2623
#define COG1DBR_DBR4                  2624
#define G1DBR5                        2625
#define COG1DBR_DBR5                  2626
#define COG1DBF                       2627
#define COG1DBF_DBF0                  2628
#define G1DBF0                        2629
#define G1DBF                         2630
#define G1DBF1                        2631
#define COG1DBF_DBF1                  2632
#define G1DBF2                        2633
#define COG1DBF_DBF2                  2634
#define G1DBF3                        2635
#define COG1DBF_DBF3                  2636
#define G1DBF4                        2637
#define COG1DBF_DBF4                  2638
#define G1DBF5                        2639
#define COG1DBF_DBF5                  2640
#define COG1CON0                      2641
#define COG1CON0_MD                   2642
#define G1MD0                         2643
#define COG1CON0_MD0                  2644
#define G1MD                          2645
#define G1MD1                         2646
#define COG1CON0_MD1                  2647
#define G1MD2                         2648
#define COG1CON0_MD2                  2649
#define COG1CON0_CS0                  2650
#define G1CS                          2651
#define G1CS0                         2652
#define COG1CON0_CS                   2653
#define COG1CON0_CS1                  2654
#define G1CS1                         2655
#define G1LD                          2656
#define COG1CON0_LD                   2657
#define COG1CON0_EN                   2658
#define G1EN                          2659
#define COG1CON1                      2660
#define COG1CON1_POLA                 2661
#define G1POLA                        2662
#define COG1CON1_POLB                 2663
#define G1POLB                        2664
#define COG1CON1_POLC                 2665
#define G1POLC                        2666
#define COG1CON1_POLD                 2667
#define G1POLD                        2668
#define COG1CON1_FDBS                 2669
#define G1FDBS                        2670
#define COG1CON1_RDBS                 2671
#define G1RDBS                        2672
#define COG1RIS0                      2673
#define COG1RIS0_RIS0                 2674
#define G1RIS0                        2675
#define COG1RIS0_RIS1                 2676
#define G1RIS1                        2677
#define COG1RIS0_RIS2                 2678
#define G1RIS2                        2679
#define COG1RIS0_RIS3                 2680
#define G1RIS3                        2681
#define COG1RIS0_RIS4                 2682
#define G1RIS4                        2683
#define COG1RIS0_RIS5                 2684
#define G1RIS5                        2685
#define COG1RIS0_RIS6                 2686
#define G1RIS6                        2687
#define COG1RIS0_RIS7                 2688
#define G1RIS7                        2689
#define COG1RIS1                      2690
#define COG1RIS1_RIS8                 2691
#define G1RIS8                        2692
#define COG1RIS1_RIS9                 2693
#define G1RIS9                        2694
#define G1RIS10                       2695
#define COG1RIS1_RIS10                2696
#define G1RIS11                       2697
#define COG1RIS1_RIS11                2698
#define G1RIS12                       2699
#define COG1RIS1_RIS12                2700
#define G1RIS13                       2701
#define COG1RIS1_RIS13                2702
#define G1RIS14                       2703
#define COG1RIS1_RIS14                2704
#define G1RIS15                       2705
#define COG1RIS1_RIS15                2706
#define COG1RSIM0                     2707
#define G1RSIM0                       2708
#define COG1RSIM0_RSIM0               2709
#define G1RSIM1                       2710
#define COG1RSIM0_RSIM1               2711
#define G1RSIM2                       2712
#define COG1RSIM0_RSIM2               2713
#define G1RSIM3                       2714
#define COG1RSIM0_RSIM3               2715
#define G1RSIM4                       2716
#define COG1RSIM0_RSIM4               2717
#define G1RSIM5                       2718
#define COG1RSIM0_RSIM5               2719
#define G1RSIM6                       2720
#define COG1RSIM0_RSIM6               2721
#define G1RSIM7                       2722
#define COG1RSIM0_RSIM7               2723
#define COG1RSIM1                     2724
#define COG1RSIM1_RSIM8               2725
#define G1RSIM8                       2726
#define COG1RSIM1_RSIM9               2727
#define G1RSIM9                       2728
#define G1RSIM10                      2729
#define COG1RSIM1_RSIM10              2730
#define G1RSIM11                      2731
#define COG1RSIM1_RSIM11              2732
#define G1RSIM12                      2733
#define COG1RSIM1_RSIM12              2734
#define G1RSIM13                      2735
#define COG1RSIM1_RSIM13              2736
#define G1RSIM14                      2737
#define COG1RSIM1_RSIM14              2738
#define G1RSIM15                      2739
#define COG1RSIM1_RSIM15              2740
#define COG1FIS0                      2741
#define G1FIS0                        2742
#define COG1FIS0_FIS0                 2743
#define G1FIS1                        2744
#define COG1FIS0_FIS1                 2745
#define G1FIS2                        2746
#define COG1FIS0_FIS2                 2747
#define G1FIS3                        2748
#define COG1FIS0_FIS3                 2749
#define G1FIS4                        2750
#define COG1FIS0_FIS4                 2751
#define G1FIS5                        2752
#define COG1FIS0_FIS5                 2753
#define G1FIS6                        2754
#define COG1FIS0_FIS6                 2755
#define G1FIS7                        2756
#define COG1FIS0_FIS7                 2757
#define COG1FIS1                      2758
#define G1FIS8                        2759
#define COG1FIS1_FIS8                 2760
#define G1FIS9                        2761
#define COG1FIS1_FIS9                 2762
#define G1FIS10                       2763
#define COG1FIS1_FIS10                2764
