tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1777_tdd.h
#define G1FIS11                       2765
#define COG1FIS1_FIS11                2766
#define G1FIS12                       2767
#define COG1FIS1_FIS12                2768
#define G1FIS13                       2769
#define COG1FIS1_FIS13                2770
#define G1FIS14                       2771
#define COG1FIS1_FIS14                2772
#define G1FIS15                       2773
#define COG1FIS1_FIS15                2774
#define COG1FSIM0                     2775
#define COG1FSIM0_FSIM0               2776
#define G1FSIM0                       2777
#define COG1FSIM0_FSIM1               2778
#define G1FSIM1                       2779
#define COG1FSIM0_FSIM2               2780
#define G1FSIM2                       2781
#define COG1FSIM0_FSIM3               2782
#define G1FSIM3                       2783
#define COG1FSIM0_FSIM4               2784
#define G1FSIM4                       2785
#define COG1FSIM0_FSIM5               2786
#define G1FSIM5                       2787
#define COG1FSIM0_FSIM6               2788
#define G1FSIM6                       2789
#define COG1FSIM0_FSIM7               2790
#define G1FSIM7                       2791
#define COG1FSIM1                     2792
#define COG1FSIM1_FSIM8               2793
#define G1FSIM8                       2794
#define COG1FSIM1_FSIM9               2795
#define G1FSIM9                       2796
#define COG1FSIM1_FSIM10              2797
#define G1FSIM10                      2798
#define COG1FSIM1_FSIM11              2799
#define G1FSIM11                      2800
#define COG1FSIM1_FSIM12              2801
#define G1FSIM12                      2802
#define COG1FSIM1_FSIM13              2803
#define G1FSIM13                      2804
#define COG1FSIM1_FSIM14              2805
#define G1FSIM14                      2806
#define COG1FSIM1_FSIM15              2807
#define G1FSIM15                      2808
#define COG1ASD0                      2809
#define COG1ASD0_ASDAC0               2810
#define G1ASDAC0                      2811
#define COG1ASD0_ASDAC                2812
#define G1ASDAC                       2813
#define COG1ASD0_ASDAC1               2814
#define G1ASDAC1                      2815
#define G1ASDBD0                      2816
#define COG1ASD0_ASDBD0               2817
#define G1ASDBD                       2818
#define COG1ASD0_ASDBD                2819
#define G1ASDBD1                      2820
#define COG1ASD0_ASDBD1               2821
#define G1ASREN                       2822
#define COG1ASD0_ARSEN                2823
#define G1ARSEN                       2824
#define COG1ASD0_ASREN                2825
#define COG1ASD0_ASE                  2826
#define G1ASE                         2827
#define COG1ASD1                      2828
#define COG1ASD1_AS0E                 2829
#define G1AS0E                        2830
#define G1AS1E                        2831
#define COG1ASD1_AS1E                 2832
#define COG1ASD1_AS2E                 2833
#define G1AS2E                        2834
#define COG1ASD1_AS3E                 2835
#define G1AS3E                        2836
#define G1AS4E                        2837
#define COG1ASD1_AS4E                 2838
#define G1AS5E                        2839
#define COG1ASD1_AS5E                 2840
#define G1AS6E                        2841
#define COG1ASD1_AS6E                 2842
#define G1AS7E                        2843
#define COG1ASD1_AS7E                 2844
#define COG1STR                       2845
#define G1STRA                        2846
#define COG1STR_STRA                  2847
#define G1STRB                        2848
#define COG1STR_STRB                  2849
#define G1STRC                        2850
#define COG1STR_STRC                  2851
#define G1STRD                        2852
#define COG1STR_STRD                  2853
#define COG1STR_SDATA                 2854
#define G1SDATA                       2855
#define COG1STR_SDATB                 2856
#define G1SDATB                       2857
#define COG1STR_SDATC                 2858
#define G1SDATC                       2859
#define COG1STR_SDATD                 2860
#define G1SDATD                       2861
#define COG2PHR                       2862
#define G2PHR0                        2863
#define COG2PHR_PHR                   2864
#define COG2PHR_PHR0                  2865
#define G2PHR1                        2866
#define COG2PHR_PHR1                  2867
#define G2PHR2                        2868
#define COG2PHR_PHR2                  2869
#define G2PHR3                        2870
#define COG2PHR_PHR3                  2871
#define G2PHR4                        2872
#define COG2PHR_PHR4                  2873
#define G2PHR5                        2874
#define COG2PHR_PHR5                  2875
#define COG2PHF                       2876
#define COG2PHF_PHF                   2877
#define COG2PHF_PHF0                  2878
#define G2PHF0                        2879
#define COG2PHF_PHF1                  2880
#define G2PHF1                        2881
#define COG2PHF_PHF2                  2882
#define G2PHF2                        2883
#define G2PHF3                        2884
#define COG2PHF_PHF3                  2885
#define COG2PHF_PHF4                  2886
#define G2PHF4                        2887
#define COG2PHF_PHF5                  2888
#define G2PHF5                        2889
#define COG2BLKR                      2890
#define G2BLKR0                       2891
#define COG2BLKR_BLKR                 2892
#define COG2BLKR_BLKR0                2893
#define G2BLKR1                       2894
#define COG2BLKR_BLKR1                2895
#define G2BLKR2                       2896
#define COG2BLKR_BLKR2                2897
#define G2BLKR3                       2898
#define COG2BLKR_BLKR3                2899
#define G2BLKR4                       2900
#define COG2BLKR_BLKR4                2901
#define G2BLKR5                       2902
#define COG2BLKR_BLKR5                2903
#define COG2BLKF                      2904
#define COG2BLKF_BLKF                 2905
#define G2BLKF0                       2906
#define COG2BLKF_BLKF0                2907
#define COG2BLKF_BLKF1                2908
#define G2BLKF1                       2909
#define COG2BLKF_BLKF2                2910
#define G2BLKF2                       2911
#define COG2BLKF_BLKF3                2912
#define G2BLKF3                       2913
#define COG2BLKF_BLKF4                2914
#define G2BLKF4                       2915
#define COG2BLKF_BLKF5                2916
#define G2BLKF5                       2917
#define COG2DBR                       2918
#define COG2DBR_DBR0                  2919
#define G2DBR0                        2920
#define COG2DBR_DBR                   2921
#define COG2DBR_DBR1                  2922
#define G2DBR1                        2923
#define COG2DBR_DBR2                  2924
#define G2DBR2                        2925
#define COG2DBR_DBR3                  2926
#define G2DBR3                        2927
#define COG2DBR_DBR4                  2928
#define G2DBR4                        2929
#define COG2DBR_DBR5                  2930
#define G2DBR5                        2931
#define COG2DBF                       2932
#define G2DBF                         2933
#define G2DBF0                        2934
#define COG2DBF_DBF0                  2935
#define G2DBF1                        2936
#define COG2DBF_DBF1                  2937
#define G2DBF2                        2938
#define COG2DBF_DBF2                  2939
#define G2DBF3                        2940
#define COG2DBF_DBF3                  2941
#define G2DBF4                        2942
#define COG2DBF_DBF4                  2943
#define G2DBF5                        2944
#define COG2DBF_DBF5                  2945
#define COG2CON0                      2946
#define COG2CON0_MD0                  2947
#define G2MD                          2948
#define G2MD0                         2949
#define COG2CON0_MD                   2950
#define COG2CON0_MD1                  2951
#define G2MD1                         2952
#define COG2CON0_MD2                  2953
#define G2MD2                         2954
#define G2CS                          2955
#define COG2CON0_CS                   2956
#define COG2CON0_CS0                  2957
#define G2CS0                         2958
#define COG2CON0_CS1                  2959
#define G2CS1                         2960
#define COG2CON0_LD                   2961
#define G2LD                          2962
#define G2EN                          2963
#define COG2CON0_EN                   2964
#define COG2CON1                      2965
#define G2POLA                        2966
#define COG2CON1_POLA                 2967
#define G2POLB                        2968
#define COG2CON1_POLB                 2969
#define G2POLC                        2970
#define COG2CON1_POLC                 2971
#define G2POLD                        2972
#define COG2CON1_POLD                 2973
#define COG2CON1_FDBS                 2974
#define G2FDBS                        2975
#define G2RDBS                        2976
#define COG2CON1_RDBS                 2977
#define COG2RIS0                      2978
#define G2RIS0                        2979
#define COG2RIS0_RIS0                 2980
#define G2RIS1                        2981
#define COG2RIS0_RIS1                 2982
#define G2RIS2                        2983
#define COG2RIS0_RIS2                 2984
#define G2RIS3                        2985
#define COG2RIS0_RIS3                 2986
#define G2RIS4                        2987
#define COG2RIS0_RIS4                 2988
#define G2RIS5                        2989
#define COG2RIS0_RIS5                 2990
#define G2RIS6                        2991
#define COG2RIS0_RIS6                 2992
#define G2RIS7                        2993
#define COG2RIS0_RIS7                 2994
#define COG2RIS1                      2995
#define COG2RIS1_RIS8                 2996
#define G2RIS8                        2997
#define COG2RIS1_RIS9                 2998
#define G2RIS9                        2999
#define COG2RIS1_RIS10                3000
#define G2RIS10                       3001
#define COG2RIS1_RIS11                3002
#define G2RIS11                       3003
#define COG2RIS1_RIS12                3004
#define G2RIS12                       3005
#define COG2RIS1_RIS13                3006
#define G2RIS13                       3007
#define COG2RIS1_RIS14                3008
#define G2RIS14                       3009
#define COG2RIS1_RIS15                3010
#define G2RIS15                       3011
#define COG2RSIM0                     3012
#define G2RSIM0                       3013
#define COG2RSIM0_RSIM0               3014
#define G2RSIM1                       3015
#define COG2RSIM0_RSIM1               3016
#define G2RSIM2                       3017
#define COG2RSIM0_RSIM2               3018
#define G2RSIM3                       3019
#define COG2RSIM0_RSIM3               3020
#define G2RSIM4                       3021
#define COG2RSIM0_RSIM4               3022
#define G2RSIM5                       3023
#define COG2RSIM0_RSIM5               3024
#define G2RSIM6                       3025
#define COG2RSIM0_RSIM6               3026
#define G2RSIM7                       3027
#define COG2RSIM0_RSIM7               3028
#define COG2RSIM1                     3029
#define G2RSIM8                       3030
#define COG2RSIM1_RSIM8               3031
#define G2RSIM9                       3032
#define COG2RSIM1_RSIM9               3033
#define COG2RSIM1_RSIM10              3034
#define G2RSIM10                      3035
#define COG2RSIM1_RSIM11              3036
#define G2RSIM11                      3037
#define COG2RSIM1_RSIM12              3038
#define G2RSIM12                      3039
#define COG2RSIM1_RSIM13              3040
#define G2RSIM13                      3041
#define COG2RSIM1_RSIM14              3042
#define G2RSIM14                      3043
#define COG2RSIM1_RSIM15              3044
#define G2RSIM15                      3045
#define COG2FIS0                      3046
#define G2FIS0                        3047
#define COG2FIS0_FIS0                 3048
#define G2FIS1                        3049
#define COG2FIS0_FIS1                 3050
#define G2FIS2                        3051
#define COG2FIS0_FIS2                 3052
#define G2FIS3                        3053
#define COG2FIS0_FIS3                 3054
#define G2FIS4                        3055
#define COG2FIS0_FIS4                 3056
#define G2FIS5                        3057
#define COG2FIS0_FIS5                 3058
#define G2FIS6                        3059
#define COG2FIS0_FIS6                 3060
#define G2FIS7                        3061
#define COG2FIS0_FIS7                 3062
#define COG2FIS1                      3063
#define G2FIS8                        3064
#define COG2FIS1_FIS8                 3065
#define G2FIS9                        3066
#define COG2FIS1_FIS9                 3067
#define COG2FIS1_FIS10                3068
#define G2FIS10                       3069
#define COG2FIS1_FIS11                3070
#define G2FIS11                       3071
#define COG2FIS1_FIS12                3072
#define G2FIS12                       3073
#define COG2FIS1_FIS13                3074
#define G2FIS13                       3075
#define COG2FIS1_FIS14                3076
#define G2FIS14                       3077
#define COG2FIS1_FIS15                3078
#define G2FIS15                       3079
#define COG2FSIM0                     3080
#define COG2FSIM0_FSIM0               3081
#define G2FSIM0                       3082
#define COG2FSIM0_FSIM1               3083
#define G2FSIM1                       3084
#define COG2FSIM0_FSIM2               3085
#define G2FSIM2                       3086
#define COG2FSIM0_FSIM3               3087
#define G2FSIM3                       3088
#define G2FSIM4                       3089
#define COG2FSIM0_FSIM4               3090
#define G2FSIM5                       3091
#define COG2FSIM0_FSIM5               3092
#define COG2FSIM0_FSIM6               3093
#define G2FSIM6                       3094
#define G2FSIM7                       3095
#define COG2FSIM0_FSIM7               3096
#define COG2FSIM1                     3097
#define G2FSIM8                       3098
#define COG2FSIM1_FSIM8               3099
#define G2FSIM9                       3100
#define COG2FSIM1_FSIM9               3101
#define G2FSIM10                      3102
#define COG2FSIM1_FSIM10              3103
#define G2FSIM11                      3104
#define COG2FSIM1_FSIM11              3105
#define G2FSIM12                      3106
#define COG2FSIM1_FSIM12              3107
#define G2FSIM13                      3108
#define COG2FSIM1_FSIM13              3109
#define G2FSIM14                      3110
#define COG2FSIM1_FSIM14              3111
#define G2FSIM15                      3112
#define COG2FSIM1_FSIM15              3113
#define COG2ASD0                      3114
#define COG2ASD0_ASDAC0               3115
#define G2ASDAC                       3116
#define COG2ASD0_ASDAC                3117
#define G2ASDAC0                      3118
#define COG2ASD0_ASDAC1               3119
#define G2ASDAC1                      3120
#define COG2ASD0_ASDBD                3121
#define G2ASDBD0                      3122
#define COG2ASD0_ASDBD0               3123
#define G2ASDBD                       3124
#define G2ASDBD1                      3125
#define COG2ASD0_ASDBD1               3126
#define G2ARSEN                       3127
#define COG2ASD0_ARSEN                3128
#define COG2ASD0_ASREN                3129
#define G2ASREN                       3130
#define COG2ASD0_ASE                  3131
#define G2ASE                         3132
#define COG2ASD1                      3133
#define COG2ASD1_AS0E                 3134
#define G2AS0E                        3135
#define G2AS1E                        3136
#define COG2ASD1_AS1E                 3137
#define COG2ASD1_AS2E                 3138
#define G2AS2E                        3139
#define G2AS3E                        3140
#define COG2ASD1_AS3E                 3141
#define COG2ASD1_AS4E                 3142
#define G2AS4E                        3143
#define COG2ASD1_AS5E                 3144
#define G2AS5E                        3145
#define G2AS6E                        3146
#define COG2ASD1_AS6E                 3147
#define COG2ASD1_AS7E                 3148
#define G2AS7E                        3149
#define COG2STR                       3150
#define COG2STR_STRA                  3151
#define G2STRA                        3152
#define COG2STR_STRB                  3153
#define G2STRB                        3154
#define COG2STR_STRC                  3155
#define G2STRC                        3156
#define COG2STR_STRD                  3157
#define G2STRD                        3158
#define COG2STR_SDATA                 3159
#define G2SDATA                       3160
#define COG2STR_SDATB                 3161
#define G2SDATB                       3162
#define COG2STR_SDATC                 3163
#define G2SDATC                       3164
#define COG2STR_SDATD                 3165
#define G2SDATD                       3166
#define PRG1RTSS                      3167
#define RG1RTSS0                      3168
#define PRG1RTSS_RTSS                 3169
#define PRG1RTSS_RTSS0                3170
#define RG1RTSS1                      3171
#define PRG1RTSS_RTSS1                3172
#define RG1RTSS2                      3173
#define PRG1RTSS_RTSS2                3174
#define RG1RTSS3                      3175
#define PRG1RTSS_RTSS3                3176
#define PRG1FTSS                      3177
#define RG1FTSS0                      3178
#define PRG1FTSS_FTSS                 3179
#define PRG1FTSS_FTSS0                3180
#define RG1FTSS1                      3181
#define PRG1FTSS_FTSS1                3182
#define RG1FTSS2                      3183
#define PRG1FTSS_FTSS2                3184
#define RG1FTSS3                      3185
#define PRG1FTSS_FTSS3                3186
#define PRG1INS                       3187
#define PRG1INS_INS                   3188
#define PRG1INS_INS0                  3189
#define RG1INS0                       3190
#define PRG1INS_INS1                  3191
#define RG1INS1                       3192
#define PRG1INS_INS2                  3193
#define RG1INS2                       3194
#define PRG1INS_INS3                  3195
#define RG1INS3                       3196
#define PRG1CON0                      3197
#define PRG1CON0_GO                   3198
#define RG1GO                         3199
#define RG1OS                         3200
#define PRG1CON0_OS                   3201
#define RG1MODE0                      3202
#define RG1MODE                       3203
#define PRG1CON0_MODE                 3204
#define PRG1CON0_MODE0                3205
#define RG1MODE1                      3206
#define PRG1CON0_MODE1                3207
#define PRG1CON0_REDG                 3208
#define RG1REDG                       3209
#define RG1FEDG                       3210
#define PRG1CON0_FEDG                 3211
#define PRG1CON0_EN                   3212
#define RG1EN                         3213
#define PRG1CON1                      3214
#define PRG1CON1_RPOL                 3215
#define RG1RPOL                       3216
#define PRG1CON1_FPOL                 3217
#define RG1FPOL                       3218
#define PRG1CON1_RDY                  3219
#define RG1RDY                        3220
#define PRG1CON2                      3221
#define RG1ISET0                      3222
#define PRG1CON2_ISET                 3223
#define RG1ISET                       3224
#define PRG1CON2_ISET0                3225
#define RG1ISET1                      3226
#define PRG1CON2_ISET1                3227
#define RG1ISET2                      3228
#define PRG1CON2_ISET2                3229
#define RG1ISET3                      3230
#define PRG1CON2_ISET3                3231
#define RG1ISET4                      3232
#define PRG1CON2_ISET4                3233
#define PRG2RTSS                      3234
#define PRG2RTSS_RTSS                 3235
#define RG2RTSS0                      3236
#define PRG2RTSS_RTSS0                3237
#define RG2RTSS1                      3238
#define PRG2RTSS_RTSS1                3239
#define RG2RTSS2                      3240
#define PRG2RTSS_RTSS2                3241
#define RG2RTSS3                      3242
#define PRG2RTSS_RTSS3                3243
#define PRG2FTSS                      3244
#define RG2FTSS0                      3245
#define PRG2FTSS_FTSS                 3246
#define PRG2FTSS_FTSS0                3247
#define RG2FTSS1                      3248
#define PRG2FTSS_FTSS1                3249
#define PRG2FTSS_FTSS2                3250
#define RG2FTSS2                      3251
#define RG2FTSS3                      3252
#define PRG2FTSS_FTSS3                3253
#define PRG2INS                       3254
#define PRG2INS_INS                   3255
#define PRG2INS_INS0                  3256
#define RG2INS0                       3257
#define PRG2INS_INS1                  3258
#define RG2INS1                       3259
#define PRG2INS_INS2                  3260
#define RG2INS2                       3261
#define PRG2INS_INS3                  3262
#define RG2INS3                       3263
#define PRG2CON0                      3264
#define PRG2CON0_GO                   3265
#define RG2GO                         3266
#define PRG2CON0_OS                   3267
#define RG2OS                         3268
#define RG2MODE0                      3269
#define PRG2CON0_MODE0                3270
#define RG2MODE                       3271
#define PRG2CON0_MODE                 3272
#define RG2MODE1                      3273
#define PRG2CON0_MODE1                3274
#define PRG2CON0_REDG                 3275
#define RG2REDG                       3276
#define RG2FEDG                       3277
#define PRG2CON0_FEDG                 3278
#define PRG2CON0_EN                   3279
#define RG2EN                         3280
#define PRG2CON1                      3281
#define PRG2CON1_RPOL                 3282
#define RG2RPOL                       3283
#define PRG2CON1_FPOL                 3284
#define RG2FPOL                       3285
#define PRG2CON1_RDY                  3286
#define RG2RDY                        3287
#define PRG2CON2                      3288
#define PRG2CON2_ISET                 3289
#define RG2ISET0                      3290
#define PRG2CON2_ISET0                3291
#define RG2ISET                       3292
#define RG2ISET1                      3293
#define PRG2CON2_ISET1                3294
#define RG2ISET2                      3295
#define PRG2CON2_ISET2                3296
#define RG2ISET3                      3297
#define PRG2CON2_ISET3                3298
#define PRG2CON2_ISET4                3299
#define RG2ISET4                      3300
#define PRG3RTSS                      3301
#define PRG3RTSS_RTSS0                3302
#define PRG3RTSS_RTSS                 3303
#define RG3RTSS0                      3304
#define PRG3RTSS_RTSS1                3305
#define RG3RTSS1                      3306
#define PRG3RTSS_RTSS2                3307
#define RG3RTSS2                      3308
#define PRG3RTSS_RTSS3                3309
#define RG3RTSS3                      3310
#define PRG3FTSS                      3311
#define PRG3FTSS_FTSS0                3312
#define RG3FTSS0                      3313
#define PRG3FTSS_FTSS                 3314
#define RG3FTSS1                      3315
#define PRG3FTSS_FTSS1                3316
#define RG3FTSS2                      3317
#define PRG3FTSS_FTSS2                3318
#define RG3FTSS3                      3319
#define PRG3FTSS_FTSS3                3320
#define PRG3INS                       3321
#define RG3INS0                       3322
