tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1777_tdd.h
#define PRG3INS_INS0                  3323
#define PRG3INS_INS                   3324
#define RG3INS1                       3325
#define PRG3INS_INS1                  3326
#define PRG3INS_INS2                  3327
#define RG3INS2                       3328
#define RG3INS3                       3329
#define PRG3INS_INS3                  3330
#define PRG3CON0                      3331
#define PRG3CON0_GO                   3332
#define RG3GO                         3333
#define RG3OS                         3334
#define PRG3CON0_OS                   3335
#define PRG3CON0_MODE                 3336
#define RG3MODE                       3337
#define PRG3CON0_MODE0                3338
#define RG3MODE0                      3339
#define PRG3CON0_MODE1                3340
#define RG3MODE1                      3341
#define PRG3CON0_REDG                 3342
#define RG3REDG                       3343
#define PRG3CON0_FEDG                 3344
#define RG3FEDG                       3345
#define PRG3CON0_EN                   3346
#define RG3EN                         3347
#define PRG3CON1                      3348
#define PRG3CON1_RPOL                 3349
#define RG3RPOL                       3350
#define RG3FPOL                       3351
#define PRG3CON1_FPOL                 3352
#define PRG3CON1_RDY                  3353
#define RG3RDY                        3354
#define PRG3CON2                      3355
#define PRG3CON2_ISET                 3356
#define RG3ISET                       3357
#define RG3ISET0                      3358
#define PRG3CON2_ISET0                3359
#define PRG3CON2_ISET1                3360
#define RG3ISET1                      3361
#define RG3ISET2                      3362
#define PRG3CON2_ISET2                3363
#define RG3ISET3                      3364
#define PRG3CON2_ISET3                3365
#define PRG3CON2_ISET4                3366
#define RG3ISET4                      3367
#define COG3PHR                       3368
#define COG3PHR_PHR0                  3369
#define G3PHR0                        3370
#define COG3PHR_PHR                   3371
#define G3PHR1                        3372
#define COG3PHR_PHR1                  3373
#define COG3PHR_PHR2                  3374
#define G3PHR2                        3375
#define COG3PHR_PHR3                  3376
#define G3PHR3                        3377
#define COG3PHR_PHR4                  3378
#define G3PHR4                        3379
#define G3PHR5                        3380
#define COG3PHR_PHR5                  3381
#define COG3PHF                       3382
#define COG3PHF_PHF                   3383
#define G3PHF0                        3384
#define COG3PHF_PHF0                  3385
#define COG3PHF_PHF1                  3386
#define G3PHF1                        3387
#define COG3PHF_PHF2                  3388
#define G3PHF2                        3389
#define COG3PHF_PHF3                  3390
#define G3PHF3                        3391
#define COG3PHF_PHF4                  3392
#define G3PHF4                        3393
#define COG3PHF_PHF5                  3394
#define G3PHF5                        3395
#define COG3BLKR                      3396
#define COG3BLKR_BLKR0                3397
#define G3BLKR0                       3398
#define COG3BLKR_BLKR                 3399
#define COG3BLKR_BLKR1                3400
#define G3BLKR1                       3401
#define COG3BLKR_BLKR2                3402
#define G3BLKR2                       3403
#define COG3BLKR_BLKR3                3404
#define G3BLKR3                       3405
#define COG3BLKR_BLKR4                3406
#define G3BLKR4                       3407
#define COG3BLKR_BLKR5                3408
#define G3BLKR5                       3409
#define COG3BLKF                      3410
#define G3BLKF0                       3411
#define COG3BLKF_BLKF                 3412
#define COG3BLKF_BLKF0                3413
#define G3BLKF1                       3414
#define COG3BLKF_BLKF1                3415
#define G3BLKF2                       3416
#define COG3BLKF_BLKF2                3417
#define G3BLKF3                       3418
#define COG3BLKF_BLKF3                3419
#define G3BLKF4                       3420
#define COG3BLKF_BLKF4                3421
#define G3BLKF5                       3422
#define COG3BLKF_BLKF5                3423
#define COG3DBR                       3424
#define G3DBR0                        3425
#define COG3DBR_DBR0                  3426
#define COG3DBR_DBR                   3427
#define G3DBR1                        3428
#define COG3DBR_DBR1                  3429
#define G3DBR2                        3430
#define COG3DBR_DBR2                  3431
#define G3DBR3                        3432
#define COG3DBR_DBR3                  3433
#define G3DBR4                        3434
#define COG3DBR_DBR4                  3435
#define G3DBR5                        3436
#define COG3DBR_DBR5                  3437
#define COG3DBF                       3438
#define G3DBF                         3439
#define G3DBF0                        3440
#define COG3DBF_DBF0                  3441
#define G3DBF1                        3442
#define COG3DBF_DBF1                  3443
#define G3DBF2                        3444
#define COG3DBF_DBF2                  3445
#define G3DBF3                        3446
#define COG3DBF_DBF3                  3447
#define G3DBF4                        3448
#define COG3DBF_DBF4                  3449
#define G3DBF5                        3450
#define COG3DBF_DBF5                  3451
#define COG3CON0                      3452
#define G3MD                          3453
#define COG3CON0_MD                   3454
#define G3MD0                         3455
#define COG3CON0_MD0                  3456
#define G3MD1                         3457
#define COG3CON0_MD1                  3458
#define COG3CON0_MD2                  3459
#define G3MD2                         3460
#define G3CS                          3461
#define COG3CON0_CS0                  3462
#define G3CS0                         3463
#define COG3CON0_CS                   3464
#define COG3CON0_CS1                  3465
#define G3CS1                         3466
#define COG3CON0_LD                   3467
#define G3LD                          3468
#define G3EN                          3469
#define COG3CON0_EN                   3470
#define COG3CON1                      3471
#define G3POLA                        3472
#define COG3CON1_POLA                 3473
#define G3POLB                        3474
#define COG3CON1_POLB                 3475
#define G3POLC                        3476
#define COG3CON1_POLC                 3477
#define COG3CON1_POLD                 3478
#define G3POLD                        3479
#define G3FDBS                        3480
#define COG3CON1_FDBS                 3481
#define COG3CON1_RDBS                 3482
#define G3RDBS                        3483
#define COG3RIS0                      3484
#define G3RIS0                        3485
#define COG3RIS0_RIS0                 3486
#define G3RIS1                        3487
#define COG3RIS0_RIS1                 3488
#define G3RIS2                        3489
#define COG3RIS0_RIS2                 3490
#define G3RIS3                        3491
#define COG3RIS0_RIS3                 3492
#define G3RIS4                        3493
#define COG3RIS0_RIS4                 3494
#define G3RIS5                        3495
#define COG3RIS0_RIS5                 3496
#define G3RIS6                        3497
#define COG3RIS0_RIS6                 3498
#define G3RIS7                        3499
#define COG3RIS0_RIS7                 3500
#define COG3RIS1                      3501
#define G3RIS9                        3502
#define COG3RIS1_RIS9                 3503
#define G3RIS11                       3504
#define COG3RIS1_RIS11                3505
#define G3RIS12                       3506
#define COG3RIS1_RIS12                3507
#define G3RIS13                       3508
#define COG3RIS1_RIS13                3509
#define G3RIS14                       3510
#define COG3RIS1_RIS14                3511
#define G3RIS15                       3512
#define COG3RIS1_RIS15                3513
#define COG3RSIM0                     3514
#define G3RSIM0                       3515
#define COG3RSIM0_RSIM0               3516
#define G3RSIM1                       3517
#define COG3RSIM0_RSIM1               3518
#define G3RSIM2                       3519
#define COG3RSIM0_RSIM2               3520
#define G3RSIM3                       3521
#define COG3RSIM0_RSIM3               3522
#define G3RSIM4                       3523
#define COG3RSIM0_RSIM4               3524
#define G3RSIM5                       3525
#define COG3RSIM0_RSIM5               3526
#define G3RSIM6                       3527
#define COG3RSIM0_RSIM6               3528
#define G3RSIM7                       3529
#define COG3RSIM0_RSIM7               3530
#define COG3RSIM1                     3531
#define G3RSIM9                       3532
#define COG3RSIM1_RSIM9               3533
#define G3RSIM11                      3534
#define COG3RSIM1_RSIM11              3535
#define G3RSIM12                      3536
#define COG3RSIM1_RSIM12              3537
#define G3RSIM13                      3538
#define COG3RSIM1_RSIM13              3539
#define G3RSIM14                      3540
#define COG3RSIM1_RSIM14              3541
#define G3RSIM15                      3542
#define COG3RSIM1_RSIM15              3543
#define COG3FIS0                      3544
#define COG3FIS0_FIS0                 3545
#define G3FIS0                        3546
#define COG3FIS0_FIS1                 3547
#define G3FIS1                        3548
#define COG3FIS0_FIS2                 3549
#define G3FIS2                        3550
#define COG3FIS0_FIS3                 3551
#define G3FIS3                        3552
#define COG3FIS0_FIS4                 3553
#define G3FIS4                        3554
#define COG3FIS0_FIS5                 3555
#define G3FIS5                        3556
#define COG3FIS0_FIS6                 3557
#define G3FIS6                        3558
#define G3FIS7                        3559
#define COG3FIS0_FIS7                 3560
#define COG3FIS1                      3561
#define G3FIS9                        3562
#define COG3FIS1_FIS9                 3563
#define COG3FIS1_FIS11                3564
#define G3FIS11                       3565
#define G3FIS12                       3566
#define COG3FIS1_FIS12                3567
#define G3FIS13                       3568
#define COG3FIS1_FIS13                3569
#define G3FIS14                       3570
#define COG3FIS1_FIS14                3571
#define G3FIS15                       3572
#define COG3FIS1_FIS15                3573
#define COG3FSIM0                     3574
#define COG3FSIM0_FSIM0               3575
#define G3FSIM0                       3576
#define G3FSIM1                       3577
#define COG3FSIM0_FSIM1               3578
#define COG3FSIM0_FSIM2               3579
#define G3FSIM2                       3580
#define COG3FSIM0_FSIM3               3581
#define G3FSIM3                       3582
#define G3FSIM4                       3583
#define COG3FSIM0_FSIM4               3584
#define COG3FSIM0_FSIM5               3585
#define G3FSIM5                       3586
#define COG3FSIM0_FSIM6               3587
#define G3FSIM6                       3588
#define COG3FSIM0_FSIM7               3589
#define G3FSIM7                       3590
#define COG3FSIM1                     3591
#define COG3FSIM1_FSIM9               3592
#define G3FSIM9                       3593
#define COG3FSIM1_FSIM11              3594
#define G3FSIM11                      3595
#define G3FSIM12                      3596
#define COG3FSIM1_FSIM12              3597
#define COG3FSIM1_FSIM13              3598
#define G3FSIM13                      3599
#define G3FSIM14                      3600
#define COG3FSIM1_FSIM14              3601
#define G3FSIM15                      3602
#define COG3FSIM1_FSIM15              3603
#define COG3ASD0                      3604
#define COG3ASD0_ASDAC0               3605
#define G3ASDAC                       3606
#define G3ASDAC0                      3607
#define COG3ASD0_ASDAC                3608
#define COG3ASD0_ASDAC1               3609
#define G3ASDAC1                      3610
#define G3ASDBD                       3611
#define COG3ASD0_ASDBD                3612
#define G3ASDBD0                      3613
#define COG3ASD0_ASDBD0               3614
#define COG3ASD0_ASDBD1               3615
#define G3ASDBD1                      3616
#define COG3ASD0_ASREN                3617
#define COG3ASD0_ARSEN                3618
#define G3ASREN                       3619
#define G3ARSEN                       3620
#define COG3ASD0_ASE                  3621
#define G3ASE                         3622
#define COG3ASD1                      3623
#define G3AS0E                        3624
#define COG3ASD1_AS0E                 3625
#define G3AS1E                        3626
#define COG3ASD1_AS1E                 3627
#define COG3ASD1_AS2E                 3628
#define G3AS2E                        3629
#define G3AS3E                        3630
#define COG3ASD1_AS3E                 3631
#define G3AS4E                        3632
#define COG3ASD1_AS4E                 3633
#define G3AS5E                        3634
#define COG3ASD1_AS5E                 3635
#define G3AS6E                        3636
#define COG3ASD1_AS6E                 3637
#define COG3ASD1_AS7E                 3638
#define G3AS7E                        3639
#define COG3STR                       3640
#define COG3STR_STRA                  3641
#define G3STRA                        3642
#define COG3STR_STRB                  3643
#define G3STRB                        3644
#define COG3STR_STRC                  3645
#define G3STRC                        3646
#define COG3STR_STRD                  3647
#define G3STRD                        3648
#define COG3STR_SDATA                 3649
#define G3SDATA                       3650
#define COG3STR_SDATB                 3651
#define G3SDATB                       3652
#define COG3STR_SDATC                 3653
#define G3SDATC                       3654
#define COG3STR_SDATD                 3655
#define G3SDATD                       3656
#define COG4PHR                       3657
#define COG4PHR_PHR                   3658
#define COG4PHR_PHR0                  3659
#define G4PHR0                        3660
#define COG4PHR_PHR1                  3661
#define G4PHR1                        3662
#define COG4PHR_PHR2                  3663
#define G4PHR2                        3664
#define COG4PHR_PHR3                  3665
#define G4PHR3                        3666
#define COG4PHR_PHR4                  3667
#define G4PHR4                        3668
#define COG4PHR_PHR5                  3669
#define G4PHR5                        3670
#define COG4PHF                       3671
#define COG4PHF_PHF                   3672
#define G4PHF0                        3673
#define COG4PHF_PHF0                  3674
#define G4PHF1                        3675
#define COG4PHF_PHF1                  3676
#define G4PHF2                        3677
#define COG4PHF_PHF2                  3678
#define G4PHF3                        3679
#define COG4PHF_PHF3                  3680
#define G4PHF4                        3681
#define COG4PHF_PHF4                  3682
#define G4PHF5                        3683
#define COG4PHF_PHF5                  3684
#define COG4BLKR                      3685
#define COG4BLKR_BLKR                 3686
#define G4BLKR0                       3687
#define COG4BLKR_BLKR0                3688
#define COG4BLKR_BLKR1                3689
#define G4BLKR1                       3690
#define G4BLKR2                       3691
#define COG4BLKR_BLKR2                3692
#define G4BLKR3                       3693
#define COG4BLKR_BLKR3                3694
#define G4BLKR4                       3695
#define COG4BLKR_BLKR4                3696
#define G4BLKR5                       3697
#define COG4BLKR_BLKR5                3698
#define COG4BLKF                      3699
#define COG4BLKF_BLKF0                3700
#define G4BLKF0                       3701
#define COG4BLKF_BLKF                 3702
#define COG4BLKF_BLKF1                3703
#define G4BLKF1                       3704
#define COG4BLKF_BLKF2                3705
#define G4BLKF2                       3706
#define COG4BLKF_BLKF3                3707
#define G4BLKF3                       3708
#define COG4BLKF_BLKF4                3709
#define G4BLKF4                       3710
#define COG4BLKF_BLKF5                3711
#define G4BLKF5                       3712
#define COG4DBR                       3713
#define COG4DBR_DBR                   3714
#define G4DBR0                        3715
#define COG4DBR_DBR0                  3716
#define G4DBR1                        3717
#define COG4DBR_DBR1                  3718
#define COG4DBR_DBR2                  3719
#define G4DBR2                        3720
#define COG4DBR_DBR3                  3721
#define G4DBR3                        3722
#define COG4DBR_DBR4                  3723
#define G4DBR4                        3724
#define COG4DBR_DBR5                  3725
#define G4DBR5                        3726
#define COG4DBF                       3727
#define G4DBF                         3728
#define COG4DBF_DBF0                  3729
#define G4DBF0                        3730
#define COG4DBF_DBF1                  3731
#define G4DBF1                        3732
#define COG4DBF_DBF2                  3733
#define G4DBF2                        3734
#define COG4DBF_DBF3                  3735
#define G4DBF3                        3736
#define COG4DBF_DBF4                  3737
#define G4DBF4                        3738
#define COG4DBF_DBF5                  3739
#define G4DBF5                        3740
#define COG4CON0                      3741
#define G4MD                          3742
#define G4MD0                         3743
#define COG4CON0_MD                   3744
#define COG4CON0_MD0                  3745
#define G4MD1                         3746
#define COG4CON0_MD1                  3747
#define G4MD2                         3748
#define COG4CON0_MD2                  3749
#define COG4CON0_CS                   3750
#define COG4CON0_CS0                  3751
#define G4CS0                         3752
#define G4CS                          3753
#define COG4CON0_CS1                  3754
#define G4CS1                         3755
#define COG4CON0_LD                   3756
#define G4LD                          3757
#define COG4CON0_EN                   3758
#define G4EN                          3759
#define COG4CON1                      3760
#define G4POLA                        3761
#define COG4CON1_POLA                 3762
#define G4POLB                        3763
#define COG4CON1_POLB                 3764
#define G4POLC                        3765
#define COG4CON1_POLC                 3766
#define G4POLD                        3767
#define COG4CON1_POLD                 3768
#define COG4CON1_FDBS                 3769
#define G4FDBS                        3770
#define G4RDBS                        3771
#define COG4CON1_RDBS                 3772
#define COG4RIS0                      3773
#define COG4RIS0_RIS0                 3774
#define G4RIS0                        3775
#define COG4RIS0_RIS1                 3776
#define G4RIS1                        3777
#define COG4RIS0_RIS2                 3778
#define G4RIS2                        3779
#define COG4RIS0_RIS3                 3780
#define G4RIS3                        3781
#define COG4RIS0_RIS4                 3782
#define G4RIS4                        3783
#define COG4RIS0_RIS5                 3784
#define G4RIS5                        3785
#define COG4RIS0_RIS6                 3786
#define G4RIS6                        3787
#define COG4RIS0_RIS7                 3788
#define G4RIS7                        3789
#define COG4RIS1                      3790
#define G4RIS8                        3791
#define COG4RIS1_RIS8                 3792
#define COG4RIS1_RIS9                 3793
#define G4RIS9                        3794
#define COG4RIS1_RIS10                3795
#define G4RIS10                       3796
#define COG4RIS1_RIS11                3797
#define G4RIS11                       3798
#define COG4RIS1_RIS12                3799
#define G4RIS12                       3800
#define COG4RIS1_RIS13                3801
#define G4RIS13                       3802
#define G4RIS14                       3803
#define COG4RIS1_RIS14                3804
#define COG4RIS1_RIS15                3805
#define G4RIS15                       3806
#define COG4RSIM0                     3807
#define COG4RSIM0_RSIM0               3808
#define G4RSIM0                       3809
#define G4RSIM1                       3810
#define COG4RSIM0_RSIM1               3811
#define COG4RSIM0_RSIM2               3812
#define G4RSIM2                       3813
#define COG4RSIM0_RSIM3               3814
#define G4RSIM3                       3815
#define G4RSIM4                       3816
#define COG4RSIM0_RSIM4               3817
#define COG4RSIM0_RSIM5               3818
#define G4RSIM5                       3819
#define COG4RSIM0_RSIM6               3820
#define G4RSIM6                       3821
#define COG4RSIM0_RSIM7               3822
#define G4RSIM7                       3823
#define COG4RSIM1                     3824
#define COG4RSIM1_RSIM8               3825
#define G4RSIM8                       3826
#define COG4RSIM1_RSIM9               3827
#define G4RSIM9                       3828
#define COG4RSIM1_RSIM10              3829
#define G4RSIM10                      3830
#define COG4RSIM1_RSIM11              3831
#define G4RSIM11                      3832
#define COG4RSIM1_RSIM12              3833
#define G4RSIM12                      3834
#define COG4RSIM1_RSIM13              3835
#define G4RSIM13                      3836
#define COG4RSIM1_RSIM14              3837
#define G4RSIM14                      3838
#define COG4RSIM1_RSIM15              3839
#define G4RSIM15                      3840
#define COG4FIS0                      3841
#define G4FIS0                        3842
#define COG4FIS0_FIS0                 3843
#define G4FIS1                        3844
#define COG4FIS0_FIS1                 3845
#define G4FIS2                        3846
#define COG4FIS0_FIS2                 3847
#define G4FIS3                        3848
#define COG4FIS0_FIS3                 3849
#define G4FIS4                        3850
#define COG4FIS0_FIS4                 3851
#define G4FIS5                        3852
#define COG4FIS0_FIS5                 3853
#define G4FIS6                        3854
#define COG4FIS0_FIS6                 3855
#define G4FIS7                        3856
#define COG4FIS0_FIS7                 3857
#define COG4FIS1                      3858
#define COG4FIS1_FIS8                 3859
#define G4FIS8                        3860
#define COG4FIS1_FIS9                 3861
#define G4FIS9                        3862
#define G4FIS10                       3863
#define COG4FIS1_FIS10                3864
#define G4FIS11                       3865
#define COG4FIS1_FIS11                3866
#define G4FIS12                       3867
#define COG4FIS1_FIS12                3868
#define G4FIS13                       3869
#define COG4FIS1_FIS13                3870
#define G4FIS14                       3871
#define COG4FIS1_FIS14                3872
#define G4FIS15                       3873
#define COG4FIS1_FIS15                3874
#define COG4FSIM0                     3875
#define COG4FSIM0_FSIM0               3876
#define G4FSIM0                       3877
#define COG4FSIM0_FSIM1               3878
#define G4FSIM1                       3879
#define COG4FSIM0_FSIM2               3880
