tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1777_tdd.h
#define LC4D4S3                       5555
#define CLC4SEL3_D4S3                 5556
#define LC4D4S4                       5557
#define CLC4SEL3_D4S4                 5558
#define LC4D4S5                       5559
#define CLC4SEL3_D4S5                 5560
#define CLC4GLS0                      5561
#define CLC4GLS0_D1N                  5562
#define LC4G1D1N                      5563
#define CLC4GLS0_D1T                  5564
#define LC4G1D1T                      5565
#define CLC4GLS0_D2N                  5566
#define LC4G1D2N                      5567
#define CLC4GLS0_D2T                  5568
#define LC4G1D2T                      5569
#define CLC4GLS0_D3N                  5570
#define LC4G1D3N                      5571
#define CLC4GLS0_D3T                  5572
#define LC4G1D3T                      5573
#define CLC4GLS0_D4N                  5574
#define LC4G1D4N                      5575
#define CLC4GLS0_D4T                  5576
#define LC4G1D4T                      5577
#define CLC4GLS1                      5578
#define CLC4GLS1_D1N                  5579
#define LC4G2D1N                      5580
#define CLC4GLS1_D1T                  5581
#define LC4G2D1T                      5582
#define LC4G2D2N                      5583
#define CLC4GLS1_D2N                  5584
#define LC4G2D2T                      5585
#define CLC4GLS1_D2T                  5586
#define CLC4GLS1_D3N                  5587
#define LC4G2D3N                      5588
#define LC4G2D3T                      5589
#define CLC4GLS1_D3T                  5590
#define CLC4GLS1_D4N                  5591
#define LC4G2D4N                      5592
#define CLC4GLS1_D4T                  5593
#define LC4G2D4T                      5594
#define CLC4GLS2                      5595
#define CLC4GLS2_D1N                  5596
#define LC4G3D1N                      5597
#define CLC4GLS2_D1T                  5598
#define LC4G3D1T                      5599
#define LC4G3D2N                      5600
#define CLC4GLS2_D2N                  5601
#define LC4G3D2T                      5602
#define CLC4GLS2_D2T                  5603
#define CLC4GLS2_D3N                  5604
#define LC4G3D3N                      5605
#define CLC4GLS2_D3T                  5606
#define LC4G3D3T                      5607
#define LC4G3D4N                      5608
#define CLC4GLS2_D4N                  5609
#define LC4G3D4T                      5610
#define CLC4GLS2_D4T                  5611
#define CLC4GLS3                      5612
#define CLC4GLS3_G4D1N                5613
#define LC4G4D1N                      5614
#define LC4G4D1T                      5615
#define CLC4GLS3_G4D1T                5616
#define LC4G4D2N                      5617
#define CLC4GLS3_G4D2N                5618
#define LC4G4D2T                      5619
#define CLC4GLS3_G4D2T                5620
#define CLC4GLS3_G4D3N                5621
#define LC4G4D3N                      5622
#define CLC4GLS3_G4D3T                5623
#define LC4G4D3T                      5624
#define LC4G4D4N                      5625
#define CLC4GLS3_G4D4N                5626
#define LC4G4D4T                      5627
#define CLC4GLS3_G4D4T                5628
#define STATUS_SHAD                   5629
#define C_SHAD                        5630
#define DC_SHAD                       5631
#define Z_SHAD                        5632
#define WREG_SHAD                     5633
#define BSR_SHAD                      5634
#define PCLATH_SHAD                   5635
#define FSR0L_SHAD                    5636
#define FSR0H_SHAD                    5637
#define FSR1L_SHAD                    5638
#define FSR1H_SHAD                    5639
#define STKPTR                        5640
#define TOSL                          5641
#define TOSH                          5642

#endif // _PIC16LF1777_H_
